 <div class="row">
        <div class="col-lg-9">
            <h1>184.Department Highest Salary</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>The <code>Employee6</code> table holds all employees. Every employee has an Id, a salary, and there is also a column for the department Id.</p>

<pre>
+----+-------+--------+--------------+
| Id | Name  | Salary | DepartmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 70000  | 1            |
| 2 &nbsp;| Jim &nbsp; | 90000 &nbsp;| 1 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;|
| 3  | Henry | 80000  | 2            |
| 4  | Sam   | 60000  | 2            |
| 5  | Max   | 90000  | 1            |
+----+-------+--------+--------------+
</pre>

<p>The <code>Department</code> table holds all departments of the company.</p>

<pre>
+----+----------+
| Id | Name     |
+----+----------+
| 1  | IT       |
| 2  | Sales    |
+----+----------+
</pre>

<p>Write a SQL query to find employees who have the highest salary in each of the departments.&nbsp;For the above tables, your SQL query should return the following rows (order of rows does not matter).</p>

<pre>
+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Max      | 90000  |
| IT &nbsp; &nbsp; &nbsp; &nbsp; | Jim &nbsp; &nbsp; &nbsp;| 90000 &nbsp;|
| Sales      | Henry    | 80000  |
+------------+----------+--------+
</pre>

<p><strong>Explanation:</strong></p>

<p>Max and Jim both have&nbsp;the highest salary in the IT department and Henry has the highest salary in the Sales department.</p>

In [2]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [3]:
pd.read_sql_table("Employee6", engine)

   Id   Name  Salary  DepartmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [4]:
pd.read_sql_table("Department", engine)

   Id   Name
0   1     IT
1   2  Sales

In [13]:
## Method 1:
query = '''
SELECT d.Name, e.Name Employee, e.Salary
FROM Employee6 e
LEFT JOIN Department d
ON e.DepartmentId = d.Id
WHERE (e.DepartmentId, e.Salary) IN (SELECT e1.DepartmentId, max(e1.Salary)
                                     FROM Employee6 e1
                                     GROUP BY e1.DepartmentId);
'''
pd.read_sql_query(query, engine)

    Name Employee  Salary
0     IT      Jim   90000
1     IT      Max   90000
2  Sales    Henry   80000

In [16]:
## Method 1:
query = '''
SELECT d.Name, e.Name Employee, e.Salary
FROM Employee6 e
LEFT JOIN Department d
ON e.DepartmentId = d.Id
WHERE e.Salary IN (SELECT max(e1.Salary)
                   FROM Employee6 e1
                   WHERE e1.DepartmentId = e.DepartmentId);
'''
pd.read_sql_query(query, engine)

    Name Employee  Salary
0     IT      Jim   90000
1     IT      Max   90000
2  Sales    Henry   80000

## Note:
# Time:  O(n^2)
# Space: O(n)

#### 1. Subquery.